IRP/src/Documents/RetailReceiptCorrection/RetailReceiptCorrection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>RetailReceiptCorrection</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <attributes>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.RetailReturnReceipt</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.RetailReceiptCorrection</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfShipment</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Manager</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ManagerSegment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailCustomer</name>
    <type>
      <types>CatalogRef.RetailCustomers</types>
    </type>
  </attributes>
  <attributes>
    <name>UsePartnerTransactions</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalNameContract</name>
    <type>
      <types>CatalogRef.LegalNameContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsolidatedRetailSales</name>
    <type>
      <types>DocumentRef.ConsolidatedRetailSales</types>
    </type>
  </attributes>
  <attributes>
    <name>Workstation</name>
    <type>
      <types>CatalogRef.Workstations</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>EnumRef.ReceiptPaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>StatusType</name>
    <type>
      <types>EnumRef.RetailReceiptStatusTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CorrectionDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CorrectionType</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NumberTaxAuthorityPrescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocumentFiscalNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocumentShiftNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>TotalAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>NetAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>OffersAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceType</name>
      <type>
        <types>CatalogRef.PriceTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>ProfitLossCenter</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>RevenueType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AdditionalAnalytic</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>DontCalculateRow</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityInBaseUnit</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesPerson</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>UseSerialLotNumber</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsService</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InventoryOrigin</name>
      <type>
        <types>EnumRef.InventoryOriginTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Consignor</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>isControlCodeString</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityIsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>VatRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualOfferAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualOfferPercent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualOfferType</name>
      <type>
        <types>EnumRef.ManualOfferTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SpecialOffers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Offer</name>
      <type>
        <types>CatalogRef.SpecialOffers</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
    <attributes>
      <name>Bonus</name>
      <type>
        <types>DefinedType.typeSpecialOfferBonus</types>
      </type>
    </attributes>
    <attributes>
      <name>AddInfo</name>
      <type>
        <types>DefinedType.typeSpecialOfferAddInfo</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentType</name>
      <type>
        <types>CatalogRef.PaymentTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentTerminal</name>
      <type>
        <types>CatalogRef.PaymentTerminals</types>
      </type>
    </attributes>
    <attributes>
      <name>Account</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
    <attributes>
      <name>Commission</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>BankTerm</name>
      <type>
        <types>CatalogRef.BankTerms</types>
      </type>
    </attributes>
    <attributes>
      <name>RRNCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentInfo</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>FinancialMovementType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAgentPartner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAgentLegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAgentPartnerTerms</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAgentLegalNameContract</name>
      <type>
        <types>CatalogRef.LegalNameContracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Certificate</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentInFiscalPrinterMode</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SerialLotNumbers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>SerialLotNumber</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SourceOfOrigins</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>SerialLotNumber</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceOfOrigin</name>
      <type>
        <types>CatalogRef.SourceOfOrigins</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ControlCodeStrings</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CodeString</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CodeIsApproved</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>NotCheck</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ControlCodeStringType</name>
      <type>
        <types>EnumRef.ControlCodeStringType</types>
      </type>
    </attributes>
    <attributes>
      <name>Prefix</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Enums/RetailReceiptStatusTypes/RetailReceiptStatusTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>RetailReceiptStatusTypes</name>
 <enumValues>
  <name>Completed</name>
 </enumValues>
 <enumValues>
  <name>Canceled</name>
 </enumValues>
 <enumValues>
  <name>Postponed</name>
 </enumValues>
 <enumValues>
  <name>PostponedWithReserve</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/RetailReceiptCorrection/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;

	If ThisObject.StatusType = Enums.RetailReceiptStatusTypes.Completed Then
		Payments_Amount = ThisObject.Payments.Total("Amount");
		ItemList_Amount = ThisObject.ItemList.Total("TotalAmount");
		If ItemList_Amount <> Payments_Amount Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_095, Payments_Amount, ItemList_Amount));
		EndIf;
	EndIf;
	
	If Cancel Then
		Return;
	EndIf;
	
	For Each Row In ThisObject.Payments Do
		If Not ValueIsFilled(Row.Key) Then
			Row.Key = String(New UUID());
		EndIf;
	EndDo;
	
	If CurrenciesServer.NeedUpdateCurrenciesTable(ThisObject) Then
		
		Parameters = CurrenciesClientServer.GetParameters_V3(ThisObject);
		CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies);
		CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);

	EndIf;
	
	ThisObject.DocumentAmount = ThisObject.ItemList.Total("TotalAmount");
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") And FillingData.Property("Basis") Then
		FillingStructure = New Structure();
		Basis = FillingData.Basis;
		
		BasisMetadata = Basis.Metadata();
		ThisMetadata = ThisObject.Metadata();
		For Each Attr In BasisMetadata.Attributes Do
			If ThisMetadata.Attributes.Find(Attr.Name) = Undefined Then
				Continue;
			EndIf;	
			
			FillingStructure.Insert(Attr.Name, Basis[Attr.Name]);
			ThisObject[Attr.Name] = Basis[Attr.Name];
		EndDo;
		
		For Each Tab In BasisMetadata.TabularSections Do
			If ThisMetadata.TabularSections.Find(Tab.Name) = Undefined Then
				Continue;
			EndIf;
			
			FillingStructure.Insert(Tab.Name, New Array());
			For Each Row In Basis[Tab.Name] Do
				NewRow = New Structure();
				For Each Column In Tab.Attributes Do
					If ThisMetadata.TabularSections[Tab.Name].Attributes.Find(Column.Name) = Undefined Then
						Continue;
					EndIf;
					
					NewRow.Insert(Column.Name, Row[Column.Name]);
				EndDo;
				FillPropertyValues(ThisObject[Tab.Name].Add(), NewRow);
				FillingStructure[Tab.Name].Add(NewRow);
			EndDo;
		EndDo;
		ThisObject.BasisDocument = Basis;
		If TypeOf(Basis) = Type("DocumentRef.RetailReceiptCorrection") Then
			ThisObject.BasisDocumentFiscalNumber = Basis.BasisDocumentFiscalNumber;
			ThisObject.BasisDocumentShiftNumber = Basis.BasisDocumentShiftNumber;
		Else
			FiscalBasisData = InformationRegisters.DocumentFiscalStatus.GetStatusData(Basis);
			ThisObject.BasisDocumentFiscalNumber = FiscalBasisData.CheckNumber;
			ThisObject.BasisDocumentShiftNumber = FiscalBasisData.ShiftNumber;
		EndIf;
		
		ControllerClientServer_V2.SetReadOnlyProperties(ThisObject, FillingStructure);
	EndIf;
EndProcedure

Procedure OnCopy(CopiedObject)
	LinkedTables = New Array();
	LinkedTables.Add(SpecialOffers);
	LinkedTables.Add(Currencies);
	LinkedTables.Add(SerialLotNumbers);
	DocumentsServer.SetNewTableUUID(ItemList, LinkedTables);
	
	For Each Row In Payments Do
		Row.RRNCode = "";
		Row.PaymentInfo = "";
	EndDo;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If DocumentsServer.CheckItemListStores(ThisObject) Then
		Cancel = True;
	EndIf;

	If Not SerialLotNumbersServer.CheckFilling(ThisObject) Then
		Cancel = True;
	EndIf;		
EndProcedure
